Revit 2026 API

# GeometryCreationUtilitiesCreateBlendGeometry(CurveLoop, CurveLoop, ICollectionVertexPair) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateBlendGeometry(
	CurveLoop firstLoop,
	CurveLoop secondLoop,
	ICollection<VertexPair> vertexPairs
)
```
```vb
Public Shared Function CreateBlendGeometry (
	firstLoop As CurveLoop,
	secondLoop As CurveLoop,
	vertexPairs As ICollection(Of VertexPair)
) As Solid
```
```cpp
public:
static Solid^ CreateBlendGeometry(
	CurveLoop^ firstLoop,
	CurveLoop^ secondLoop,
	ICollection<VertexPair^>^ vertexPairs
)
```
```fsharp
static member CreateBlendGeometry :
        firstLoop : CurveLoop *
        secondLoop : CurveLoop *
        vertexPairs : ICollection<VertexPair> -> Solid
```

#### Parameters

firstLoop CurveLoop

secondLoop CurveLoop

vertexPairs ICollectionVertexPair

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateBlendGeometry Overload

Autodesk.Revit.DB Namespace